# 管理者作成
Admin.create!(email: "email@gmail.com", 
							name: "管理者",
							line_id: "12345",
							password: "password",
							password_confirmation: "password",
							post_code: "1000005",
							address_prefecture: "東京都",
							address_city: "千代田区丸の内",
							address_branch: "丸の内ビル１F")
puts "管理者を作成しました！"

# オーナー作成
Owner.create!(name: "オーナー１",
							email: "owner@gmai.com",
							line_id: "123456",
							password: "password",
							password_confirmation: "password",
							post_code: "1000005",
							address_prefecture: "東京都",
							address_city: "千代田区丸の内",
							address_branch: "丸の内ビル１F",
							phone_number: "09012345678")
puts "オーナーを作成しました！"

# 職種作成
Occupation.create!(name: "eye", ja: "まつエク")
Occupation.create!(name: "nail", ja: "ネイル")
Occupation.create!(name: "hair",ja: "ヘアメイク")
Occupation.create!(name: "body",ja: "エステ")
Occupation.create!(name: "therapy",ja: "セラピー")
Occupation.create!(name: "massage",ja: "マッサージ")

puts "職種を作成しました！"

# オプション作成
option = "サロンオプション"
pay = 100
# サロン設備
9.times do |index|
Option.create!(salon_facility: true, name: "#{ option }#{ index }", standard: true)
end
# フリー施術オプション
option = "施術者オプション"
3.times do |index|
	Option.create!(for_practitioner: true, name: "#{ option }#{ index }", standard: true, specific: "eye")
end
3.times do |index|
	Option.create!(for_practitioner: true, name: "#{ option }#{ index }", standard: true, specific: "nail")
end
3.times do |index|
	Option.create!(for_practitioner: true, name: "#{ option }#{ index }", standard: true)
end

# フリーお客様サービス
option = "お客様オプション"
3.times do |index|
	Option.create!(for_guest: true, name: "#{ option }#{ index }", standard: true, specific: "eye")
end
3.times do |index|
	Option.create!(for_guest: true, name: "#{ option }#{ index }", standard: true, specific: "nail")
end
3.times do |index|
	Option.create!(for_guest: true, name: "#{ option }#{ index }", standard: true)
end
puts "オプションを作成しました！"

# 駅
tokaido = ["東京","新橋","品川","川崎","横浜","戸塚","大船","藤沢","辻堂","茅ケ崎","平塚","大磯","二宮","国府津","鴨宮","小田原","早川","根府川","真鶴","湯河原","熱海"]
tokaido.each do |s|
	Station.create(area: "東京,神奈川", line: "ＪＲ東海道線", name: s)
end

yokosuka = ["東京","新橋","品川","西大井","武蔵小杉","新川崎","横浜","保土ケ谷","東戸塚","戸塚","大船","北鎌倉","鎌倉","逗子","東逗子","田浦","横須賀","衣笠","久里浜"]
yokosuka.each do |s|
	Station.create(area: "東京,神奈川", line: "ＪＲ横須賀線", name: s)
end

yokohama = ["東神奈川","大口","菊名","新横浜","小机","鴨居","中山","十日市場","長津田","成瀬","町田","古淵","淵野辺","矢部","相模原","橋本","相原","八王子みなみ野","片倉","八王子"]
yokohama.each do |s|
	Station.create(area: "東京,神奈川", line: "横浜線", name: s)
end

keihintohoku = ["大宮","さいたま新都心","与野","北浦和","浦和","南浦和","蕨","西川口","川口","","赤羽","東十条","王子","上中里","田端","西日暮里","日暮里","鶯谷","上野","御徒町","秋葉原","神田","東京","有楽町","新橋","浜松町","田町","高輪ゲートウェイ","品川","大井町","大森","蒲田","川崎","鶴見","新子安","東神奈川","横浜"]
keihintohoku.each do |s|
	Station.create(area: "東京,埼玉,神奈川", line: "ＪＲ京浜東北線", name: s)
end

keiyo = ["東京","八丁堀","越中島","潮見","新木場","葛西臨海公園","舞浜","新浦安","市川塩浜","西船橋","二俣新町","南船橋","新習志野","海浜幕張","検見川浜","稲毛海岸","千葉みなと","蘇我"]
keiyo.each do |s|
	Station.create(area: "東京,千葉", line: "ＪＲ京葉線", name: s)
end

itukaitisi = ["拝島","熊川","東秋留","秋川","武蔵引田","武蔵増戸","武蔵五日市"]
itukaitisi.each do |s|
	Station.create(area: "東京", line: "ＪＲ五日市線", name: s)
end

saikyo = ["大崎","恵比寿","渋谷","新宿","池袋","板橋","十条","赤羽","北赤羽","浮間舟渡","戸田公園","戸田","北戸田",",武蔵浦和","中浦和",",南与野","与野本町","北与野","大宮","日進","指扇","南古谷","川越"]
saikyo.each do |s|
	Station.create(area: "東京,埼玉", line: "ＪＲ埼京線", name: s)
end

yamanote = ["大崎","五反田","恵比寿","渋谷","原宿","代々木","新宿","新大久保","高田馬場","目白","池袋","大塚","巣鴨","駒込","田端","西日暮里","日暮里","鶯谷","上野","御徒町","秋葉原","神田","東京","有楽町","新橋","浜松町","田町","高輪ゲートウェイ","品川"]
yamanote.each do |s|
	Station.create(area: "", line: "ＪＲ山線", name: s)
end

joban = ["上野","日暮里","三河島","南千住","北千住","綾瀬","亀有","金町","松戸","北松戸","馬橋","新松戸","北小金","南柏","柏","北柏","我孫子","天王台","取手"]
joban.each do |s|
	Station.create(area: "東京,千葉", line: "ＪＲ常磐線（上野〜取手）", name: s)
end

jo_ban = ["藤代","龍ケ崎市","牛久","ひたち野うしく","荒川沖","土浦","神立","高浜","石岡","羽鳥","岩間","友部","内原","赤塚","偕楽園","水戸","勝田","佐和","東海","大甕","常陸多賀","日立","小木津","十王","高萩","南中郷","磯原","大津港","勿来","植田","泉","湯本","内郷","いわき"]
jo_ban.each do |s|
	Station.create(area: "茨城", line: "ＪＲ常磐線（藤代〜いわき）", name: s)
end

oume = ["立川","西立川","東中神","中神","昭島","拝島","牛浜","福生","羽村","小作","河辺","東青梅","青梅","宮ノ平","日向和田","石神前","二俣尾","軍畑","沢井","御嶽","川井","古里","鳩ノ巣","白丸","奥多摩"]
.each do |s|
	Station.create(area: "東京", line: "ＪＲ青梅線", name: s)
end

tyuo_sobu = ["三鷹","吉祥寺","西荻窪","荻窪","阿佐ケ谷","高円寺","中野","東中野","大久保","新宿","代々木","千駄ケ谷","信濃町","四ツ谷","市ケ谷","飯田橋","水道橋","御茶ノ水","秋葉原","浅草橋","両国","錦糸町","亀戸","平井","新小岩","小岩","市川","本八幡","下総中山","西船橋","船橋","東船橋","津田沼","幕張本郷","幕張","新検見川","稲毛","西千葉","千葉"]
tyuo_sobu.each do |s|
	Station.create(area: "東京", line: "ＪＲ中央・総武線", name: s)
end

sobu = ["東京","新日本橋","馬喰町","錦糸町","新小岩","市川","船橋","津田沼","稲毛","千葉","東千葉","都賀","四街道","物井","佐倉","南酒々井","榎戸","八街","日向","成東","松尾","横芝","飯倉","八日市場","干潟","旭","飯岡","倉橋","猿田","松岸","銚子"]
sobu.each do |s|
	Station.create(area: "東京,千葉", line: "ＪＲ総武本線(東京-銚子)", name: s)
end

tyuo = ["東京","神田","御茶ノ水","四ツ谷","新宿","中野","高円寺","阿佐ケ谷","荻窪","西荻窪","吉祥寺","三鷹","武蔵境","東小金井","武蔵小金井","国分寺","西国分寺","国立","立川","日野","豊田","八王子","西八王子","高尾"]
tyuo.each do |s|
	Station.create(area: "東京", line: "ＪＲ中央線(東京-高尾)", name: s)
end

utunomiya = ["上野","尾久","赤羽","浦和","さいたま新都心","大宮","土呂","東大宮","蓮田","白岡","新白岡","久喜","東鷲宮","栗橋","古河","野木","間々田","小山","小金井","自治医大","石橋","雀宮","宇都宮","岡本","宝積寺","氏家","蒲須坂","片岡","矢板","野崎","西那須野","那須塩原","黒磯"]
utunomiya.each do |s|
	Station.create(area: "東京,埼玉,栃木", line: "ＪＲ宇都宮線", name: s)
end

nanbu = ["浜川崎","小田栄","川崎新町","八丁畷","川崎","尻手","矢向","鹿島田","平間","向河原","武蔵小杉","武蔵中原","武蔵新城","武蔵溝ノ口","津田山","久地","宿河原","登戸","中野島","稲田堤","矢野口","稲城長沼","南多摩","府中本町","分倍河原","西府","谷保","矢川","西国立","立川"]
nanbu.each do |s|
	Station.create(area: "東京,神奈川", line: "ＪＲ南武線", name: s)
end

hatiko = ["八王子","北八王子","小宮","拝島","東福生","箱根ケ崎","金子","東飯能","高麗川","毛呂","越生","明覚","小川町","竹沢","折原","寄居","用土","松久","児玉","丹荘","群馬藤岡","北藤岡","倉賀野","高崎"]
hatiko.each do |s|
	Station.create(area: "東京,群馬", line: "ＪＲ八高線", name: s)
end

musasino = ["府中本町","北府中","西国分寺","新小平","新秋津","東所沢","新座","北朝霞","西浦和","武蔵浦和","南浦和","東浦和","東川口","南越谷","越谷レイクタウン","吉川","吉川美南","新三郷","三郷","南流山","新松戸","新八柱","東松戸","市川大野","船橋法典","西船橋","南船橋"]
musasino.each do |s|
	Station.create(area: "", line: "ＪＲ武蔵野線", name: s)
end

yurikamome = ["新橋","汐留","竹芝","日の出","芝浦ふ頭","お台場海浜公園","台場","東京国際クルーズターミナル","テレコムセンター","青海","東京ビッグサイト","有明","有明テニスの森","市場前","新豊洲","豊洲"]
yurikamome.each do |s|
	Station.create(area: "東京", line: "ゆりかもめ", name: s)
end

inogasira = ["渋谷","神泉","駒場東大前","池ノ上","下北沢","新代田","東松原","明大前","永福町","浜田山","高井戸","富士見ヶ丘","久我山","三鷹台","井の頭公園","吉祥寺"]
inogasira.each do |s|
	Station.create(area: "東京", line: "京王井の頭線", name: s)
end

keio = ["新宿","新線新宿","初台","幡ヶ谷","笹塚","代田橋","明大前","下高井戸","桜上水","上北沢","八幡山","芦花公園","千歳烏山","仙川","つつじヶ丘","柴崎","国領","布田","調布","京王多摩川","京王稲田堤","京王よみうりランド","稲城","若葉台","京王永山","京王多摩センター","京王堀之内","南大沢","多摩境","橋本","西調布","飛田給","武蔵野台","多磨霊園","東府中","府中","分倍河原","中河原","聖蹟桜ヶ丘","百草園","高幡不動","南平","平山城址公園","長沼","北野","京王八王子"]
keio.each do |s|
	Station.create(area: "東京", line: "京王線", name: s)
end

keibajo = ["東府中","府中競馬正門前"]
keibajo.each do |s|
	Station.create(area: "東京", line: "京王競馬場線", name: s)
end

stations = ["北野","京王片倉","山田","めじろ台","狭間","高尾","高尾山口"]
stations.each do |s|
	Station.create(area: "東京", line: "京王高尾線", name: s)
end

stations = ["新線新宿","笹塚","初台","幡ヶ谷"]
stations.each do |s|
	Station.create(area: "東京", line: "京王新線", name: s)
end

stations = ["調布","京王多摩川","京王稲田堤","京王よみうりランド","稲城","若葉台","京王永山","京王多摩センター","京王堀之内","南大沢","多摩境","橋本"]
stations.each do |s|
	Station.create(area: "東京", line: "京王相模原線", name: s)
end

stations = ["高幡不動","多摩動物公園"]
stations.each do |s|
	Station.create(area: "東京", line: "京王動物園線", name: s)
end

stations = ["押上（スカイツリー前）","京成曳舟","八広","四ツ木","京成立石","青砥","京成高砂"]
stations.each do |s|
	Station.create(area: "東京", line: "京成押上線", name: s)
end

stations = ["京成高砂","柴又","京成金町"]
stations.each do |s|
	Station.create(area: "東京", line: "京成金町線", name: s)
end

stations = ["京成上野","日暮里","新三河島","町屋","千住大橋","京成関屋","堀切菖蒲園","お花茶屋","青砥","京成高砂","京成小岩","江戸川","国府台","市川真間","菅野","京成八幡","鬼越","京成中山","東中山","京成西船","海神","京成船橋","大神宮下","船橋競馬場","谷津","京成津田沼","京成大久保","実籾","八千代台","京成大和田","勝田台","志津","ユーカリが丘","京成臼井","京成佐倉","大佐倉","京成酒々井","宗吾参道","公津の杜","京成成田","東成田","空港第２ビル（第２旅客ターミナル）","成田空港（第１旅客ターミナル）"]
stations.each do |s|
	Station.create(area: "東京,千葉", line: "京成本線", name: s)
end

stations = ["京成上野","日暮里","青砥","京成高砂","東松戸","新鎌ヶ谷","千葉ニュータウン中央","印旛日本医大","成田湯川","空港第２ビル（第２旅客ターミナル）","成田空港（第１旅客ターミナル）"]
stations.each do |s|
	Station.create(area: "東京,千葉", line: "京急空港線", name: s)
end

stations = ["泉岳寺","品川","北品川","新馬場","青物横丁","鮫洲","立会川","大森海岸","平和島","大森町","梅屋敷","京急蒲田","雑色","六郷土手","京急川崎","八丁畷","鶴見市場","京急鶴見","花月総持寺","生麦","京急新子安","子安","神奈川新町","京急東神奈川","神奈川","横浜","戸部","日ノ出町","黄金町","南太田","井土ヶ谷","弘明寺","上大岡","屏風浦","杉田","京急富岡","能見台","金沢文庫","金沢八景","追浜","京急田浦","安針塚","逸見","汐入","横須賀中央","県立大学","堀ノ内","京急大津","馬堀海岸","浦賀"]
stations.each do |s|
	Station.create(area: "東京,神奈川", line: "京急本線", name: s)
end

stations = ["京急川崎","港町","鈴木町","川崎大師","東門前","大師橋","小島新田"]
stations.each do |s|
	Station.create(area: "神奈川", line: "京急大師線", name: s)
end

stations = ["金沢八景","六浦","神武寺","逗子・葉山"]
stations.each do |s|
	Station.create(area: "神奈川", line: "京急逗子線", name: s)
end

stations = ["堀ノ内","新大津","北久里浜","京急久里浜","ＹＲＰ野比","京急長沢","津久井浜","三浦海岸","三崎口"]
stations.each do |s|
	Station.create(area: "神奈川", line: "京急久里浜線", name: s)
end

stations = ["新宿","南新宿","参宮橋","代々木八幡","代々木上原","東北沢","下北沢","世田谷代田","梅ヶ丘","豪徳寺","経堂","千歳船橋","祖師ヶ谷大蔵","成城学園前","喜多見","狛江","和泉多摩川","登戸","向ヶ丘遊園","生田","読売ランド前","百合ヶ丘","新百合ヶ丘","柿生","鶴川","玉川学園前","町田","相模大野","小田急相模原","相武台前","座間","海老名","厚木","本厚木","愛甲石田","伊勢原","鶴巻温泉","東海大学前","秦野","渋沢","新松田","開成","栢山","富水","螢田","足柄","小田原"]
stations.each do |s|
	Station.create(area: "東京,", line: "小田急小田原線", name: s)
end

stations = ["新百合ヶ丘","五月台","栗平","黒川","はるひ野","小田急永山","小田急多摩センター","唐木田"]
stations.each do |s|
	Station.create(area: "東京", line: "小田急多摩線", name: s)
end

stations = ["東村山","西武園"]
stations.each do |s|
	Station.create(area: "東京", line: "西武園線", name: s)
end

stations = ["国分寺","恋ヶ窪","鷹の台","小川","東村山"]
stations.each do |s|
	Station.create(area: "東京", line: "西武国分寺線", name: s)
end

stations = ["西武遊園地","遊園地西","西武球場前"]
stations.each do |s|
	Station.create(area: "東京", line: "西武山口線", name: s)
end

stations = ["西武新宿","高田馬場","下落合","中井","新井薬師前","沼袋","野方","都立家政","鷺ノ宮","下井草","井荻","上井草","上石神井","武蔵関","東伏見","西武柳沢","田無","花小金井","小平","久米川","東村山","所沢","航空公園","新所沢","入曽","狭山市","新狭山","南大塚","本川越"]
stations.each do |s|
	Station.create(area: "東京,埼玉", line: "西武新宿線", name: s)
end

stations = ["国分寺","一橋学園","青梅街道","萩山","八坂","武蔵大和","西武遊園地"]
stations.each do |s|
	Station.create(area: "東京,埼玉", line: "西武多摩湖線", name: s)
end

stations = ["武蔵境","新小金井","多磨","白糸台","競艇場前","是政"]
stations.each do |s|
	Station.create(area: "東京", line: "西武多摩川線", name: s)
end

stations = ["池袋","椎名町","東長崎","江古田","桜台","練馬","中村橋","富士見台","練馬高野台","石神井公園","大泉学園","保谷","ひばりヶ丘","東久留米","清瀬","秋津","所沢","西所沢","小手指","狭山ヶ丘","武蔵藤沢","稲荷山公園","入間市","仏子","元加治","飯能","東飯能","高麗","武蔵横手","東吾野","吾野"]
stations.each do |s|
	Station.create(area: "東京,埼玉", line: "西武池袋線", name: s)
end

stations = ["小平","萩山","小川","東大和市","玉川上水","武蔵砂川","西武立川","拝島"]
stations.each do |s|
	Station.create(area: "東京", line: "西武拝島線", name: s)
end

stations = ["練馬","豊島園"]
stations.each do |s|
	Station.create(area: "東京", line: "西武豊島線", name: s)
end

stations = ["多摩センター","松が谷","大塚・帝京大学","中央大学・明星大学","多摩動物公園","程久保","高幡不動","万願寺","甲州街道","柴崎体育館","立川南","立川北","高松","立飛","泉体育館","砂川七番","玉川上水","桜街道","上北台"]
stations.each do |s|
	Station.create(area: "東京", line: "多摩都市モノレール線", name: s)
end

stations = ["池袋","新大塚","茗荷谷","後楽園","本郷三丁目","御茶ノ水","淡路町","大手町","東京","銀座","霞ケ関","国会議事堂前","赤坂見附","四ツ谷","四谷三丁目","新宿御苑前","新宿三丁目","新宿","西新宿","中野坂上","新中野","東高円寺","新高円寺","南阿佐ケ谷","荻窪","中野新橋","中野富士見町","方南町"]
stations.each do |s|
	Station.create(area: "東京", line: "東京メトロ丸ノ内線", name: s)
end

stations = ["浅草","田原町","稲荷町","上野","上野広小路","末広町","神田","三越前","日本橋","京橋","銀座","新橋","虎ノ門","溜池山王","赤坂見附","青山一丁目","外苑前","表参道","渋谷"]
stations.each do |s|
	Station.create(area: "東京", line: "東京メトロ銀座線", name: s)
end

stations = ["北綾瀬","綾瀬","北千住","町屋","西日暮里","千駄木","根津","湯島","新御茶ノ水","大手町","二重橋前","日比谷","霞ケ関","国会議事堂前","赤坂","乃木坂","表参道","明治神宮前","代々木公園","代々木上原"]
stations.each do |s|
	Station.create(area: "東京", line: "東京メトロ千代田線", name: s)
end

stations = ["中野","落合","高田馬場","早稲田","神楽坂","飯田橋","九段下","竹橋","大手町","日本橋","茅場町","門前仲町","木場","東陽町","南砂町","西葛西","葛西","浦安","南行徳","行徳","妙典","原木中山","西船橋"]
stations.each do |s|
	Station.create(area: "東京,千葉", line: "東京メトロ東西線", name: s)
end

stations = ["赤羽岩淵","志茂","王子神谷","王子","西ケ原","駒込","本駒込","東大前","後楽園","飯田橋","市ケ谷","四ツ谷","永田町","溜池山王","六本木一丁目","麻布十番","白金高輪","白金台","目黒"]
stations.each do |s|
	Station.create(area: "東京", line: "東京メトロ南北線", name: s)
end

stations = ["北千住","南千住","三ノ輪","入谷","上野","仲御徒町","秋葉原","小伝馬町","人形町","茅場町","八丁堀","築地","東銀座","銀座","日比谷","霞ケ関","虎ノ門ヒルズ","神谷町","六本木","広尾","恵比寿","中目黒"]
stations.each do |s|
	Station.create(area: "東京", line: "東京メトロ日比谷線", name: s)
end

stations = ["渋谷","表参道","青山一丁目","永田町","半蔵門","九段下","神保町","大手町","三越前","水天宮前","清澄白河","住吉","錦糸町","押上〈スカイツリー前〉"]
stations.each do |s|
	Station.create(area: "東京", line: "東京メトロ半蔵門線", name: s)
end

stations = ["和光市","地下鉄成増","地下鉄赤塚","平和台","氷川台","小竹向原","千川","要町","池袋","東池袋","護国寺","江戸川橋","飯田橋","市ケ谷","麹町","永田町","桜田門","有楽町","銀座一丁目","新富町","月島","豊洲","辰巳","新木場"]
stations.each do |s|
	Station.create(area: "東京,埼玉", line: "東京メトロ有楽町線", name: s)
end

stations = ["和光市","地下鉄成増","地下鉄赤塚","平和台","氷川台","小竹向原","千川","要町","池袋","雑司が谷","西早稲田","東新宿","新宿三丁目","北参道","明治神宮前","渋谷"]
stations.each do |s|
	Station.create(area: "東京", line: "東京メトロ副都心線", name: s)
end

stations = ["浜松町","天王洲アイル","大井競馬場前","流通センター","昭和島","整備場","天空橋","羽田空港第3ターミナル","新整備場","羽田空港第1ターミナル","羽田空港第2ターミナル"]
stations.each do |s|
	Station.create(area: "東京", line: "東京モノレール", name: s)
end

stations = ["三軒茶屋","西太子堂","若林","松陰神社前","世田谷","上町","宮の坂","山下","松原","下高井戸"]
stations.each do |s|
	Station.create(area: "東京", line: "東急世田谷線", name: s)
end

stations = ["大井町","下神明","戸越公園","中延","荏原町","旗の台","北千束","大岡山","緑が丘","自由が丘","九品仏","尾山台","等々力","上野毛","二子玉川","二子新地","高津","溝の口"]
stations.each do |s|
	Station.create(area: "東京,神奈川", line: "東急大井町線", name: s)
end

stations = ["五反田","大崎広小路","戸越銀座","荏原中延","旗の台","長原","洗足池","石川台","雪が谷大塚","御嶽山","久が原","千鳥町","池上","蓮沼","蒲田"]
stations.each do |s|
	Station.create(area: "東京", line: "東急池上線", name: s)
end

stations = ["都庁前","新宿西口","東新宿","若松河田","牛込柳町","牛込神楽坂","飯田橋","春日","本郷三丁目","上野御徒町","新御徒町","蔵前","両国","森下","清澄白河","門前仲町","月島","勝どき","築地市場","汐留","大門","赤羽橋","麻布十番","六本木","青山一丁目","国立競技場","代々木","新宿","西新宿五丁目","中野坂上","東中野","中井","落合南長崎","新江古田","練馬","豊島園","練馬春日町","光が丘"]
stations.each do |s|
	Station.create(area: "東京", line: "都営大江戸線", name: s)
end

stations = ["目黒","白金台","白金高輪","三田","芝公園","御成門","内幸町","日比谷","大手町","神保町","水道橋","春日","白山","千石","巣鴨","西巣鴨","新板橋","板橋区役所前","板橋本町","本蓮沼","志村坂上","志村三丁目","蓮根","西台","高島平","新高島平","西高島平"]
stations.each do |s|
	Station.create(area: "東京", line: "都営三田線", name: s)
end

stations = ["西馬込","馬込","中延","戸越","五反田","高輪台","泉岳寺","三田","大門","新橋","東銀座","宝町","日本橋","人形町","東日本橋","浅草橋","蔵前","浅草","本所吾妻橋","押上（スカイツリー前）"]
stations.each do |s|
	Station.create(area: "東京", line: "都営浅草線", name: s)
end

stations = ["三ノ輪橋","荒川一中前","荒川区役所前","荒川二丁目","荒川七丁目","町屋駅前","町屋二丁目","東尾久三丁目","熊野前","宮ノ前","小台","荒川遊園地前","荒川車庫前","梶原","栄町","王子駅前","飛鳥山","滝野川一丁目","西ヶ原四丁目","新庚申塚","庚申塚","巣鴨新田","大塚駅前","向原","東池袋四丁目","都電雑司ヶ谷","鬼子母神前","学習院下","面影橋","早稲田"]
stations.each do |s|
	Station.create(area: "東京", line: "都電荒川線", name: s)
end

stations = ["新木場","東雲","国際展示場","東京テレポート","天王洲アイル","品川シーサイド","大井町","大崎"]
stations.each do |s|
	Station.create(area: "東京", line: "りんかい線", name: s)
end

stations = ["曳舟","小村井","東あずま","亀戸水神","亀戸"]
stations.each do |s|
	Station.create(area: "東京", line: "東武亀戸線", name: s)
end

stations = ["西新井","大師前"]
stations.each do |s|
	Station.create(area: "東京", line: "東武大師線", name: s)
end

stations = ["多摩川","沼部","鵜の木","下丸子","武蔵新田","矢口渡","蒲田"]
stations.each do |s|
	Station.create(area: "東京", line: "東急多摩川線", name: s)
end

stations = ["日暮里","西日暮里","赤土小学校前","熊野前","足立小台","扇大橋","高野","江北","西新井大師西","谷在家","舎人公園","舎人","見沼代親水公園"]
stations.each do |s|
	Station.create(area: "東京", line: "都営日暮里・舎人ライナ", name: s)
end

stations = ["渋谷","池尻大橋","三軒茶屋","駒沢大学","桜新町","用賀","二子玉川","二子新地","高津","溝の口","梶が谷","宮崎台","宮前平","鷺沼","たまプラーザ","あざみ野","江田","市が尾","藤が丘","青葉台","田奈","長津田","つくし野","すずかけ台","南町田グランベリーパーク","つきみ野","中央林間"]
stations.each do |s|
	Station.create(area: "東京,神奈川", line: "東急田園都市線", name: s)
end

stations = ["渋谷","代官山","中目黒","祐天寺","学芸大学","都立大学","自由が丘","田園調布","多摩川","新丸子","武蔵小杉","元住吉","日吉","綱島","大倉山","菊名","妙蓮寺","白楽","東白楽","反町","横浜"]
stations.each do |s|
	Station.create(area: "東京,神奈川", line: "東急東横線", name: s)
end

stations = ["目黒","不動前","武蔵小山","西小山","洗足","大岡山","奥沢","田園調布","多摩川","新丸子","武蔵小杉","元住吉","日吉"]
stations.each do |s|
	Station.create(area: "東京,神奈川", line: "東急目黒線", name: s)
end

stations = ["新宿","新宿三丁目","曙橋","市ヶ谷","九段下","神保町","小川町","岩本町","馬喰横山","浜町","森下","菊川","住吉","西大島","大島","東大島","船堀","一之江","瑞江","篠崎","本八幡"]
stations.each do |s|
	Station.create(area: "東京,千葉", line: "都営新宿線", name: s)
end

stations = ["赤羽岩淵","川口元郷","南鳩ヶ谷","鳩ヶ谷","新井宿","戸塚安行","東川口","浦和美園"]
stations.each do |s|
	Station.create(area: "東京,埼玉", line: "埼玉高速鉄道線", name: s)
end

stations = ["大宮","浦和","赤羽","池袋","新宿","渋谷","恵比寿","大崎","西大井","武蔵小杉","新川崎","横浜","保土ケ谷","東戸塚","戸塚","大船"]
stations.each do |s|
	Station.create(area: "東京,埼玉,神奈川", line: "ＪＲ湘南新宿ライン", name: s)
end

stations = ["秋葉原","新御徒町","浅草","南千住","北千住","青井","六町","八潮","三郷中央","南流山","流山セントラルパーク","流山おおたかの森","柏の葉キャンパス","柏たなか","守谷","みらい平","みどりの","万博記念公園","研究学園","つくば"]
stations.each do |s|
	Station.create(area: "東京,茨城", line: "つくばエクスプレス", name: s)
end

stations = ["上野","尾久","赤羽","浦和","さいたま新都心","大宮","宮原","上尾","北上尾","桶川","北本","鴻巣","北鴻巣","吹上","行田","熊谷","籠原","深谷","岡部","本庄","神保原","新町","倉賀野","高崎"]
stations.each do |s|
	Station.create(area: "東京,埼玉,群馬", line: "ＪＲ高崎線", name: s)
end

stations = ["京成上野","日暮里","青砥","京成高砂","東松戸","新鎌ヶ谷","千葉ニュータウン中央","印旛日本医大","成田湯川","空港第２ビル（第２旅客ターミナル）","成田空港（第１旅客ターミナル）"]
stations.each do |s|
	Station.create(area: "東京,千葉", line: "京成成田空港線", name: s)
end

stations = ["池袋","北池袋","下板橋","大山","中板橋","ときわ台","上板橋","東武練馬","下赤塚","成増","和光市","朝霞","朝霞台","志木","柳瀬川","みずほ台","鶴瀬","ふじみ野","上福岡","新河岸","川越","川越市","霞ヶ関","鶴ヶ島","若葉","坂戸","北坂戸","高坂","東松山","森林公園","つきのわ","武蔵嵐山","小川町","東武竹沢","男衾","鉢形","玉淀","寄居"]
stations.each do |s|
	Station.create(area: "東京,埼玉", line: "東武東上線", name: s)
end

stations = ["浅草","とうきょうスカイツリー","押上〈スカイツリー前〉","曳舟","東向島","鐘ヶ淵","堀切","牛田","北千住","小菅","五反野","梅島","西新井","竹ノ塚","谷塚","草加","獨協大学前","新田","蒲生","新越谷","越谷","北越谷","大袋","せんげん台","武里","一ノ割","春日部","北春日部","姫宮","東武動物公園","和戸","久喜","鷲宮","花崎","加須","南羽生","羽生","川俣","茂林寺前","館林","多々良","県","福居","東武和泉","足利市","野州山辺","韮川","太田","細谷","木崎","世良田","境町","剛志","新伊勢崎","伊勢崎"]
stations.each do |s|
	Station.create(area: "東京,埼玉,栃木,群馬", line: "東武伊勢崎線", name: s)
end

# stations = ["大宮","日進","西大宮","指扇","南古谷","川越","西川越","的場","笠幡","武蔵高萩","高麗川"]
# stations.each do |s|
# 	Station.create(area: "埼玉", line: "ＪＲ川越線", name: s)
# end

# stations = ["横浜","新高島","みなとみらい","馬車道","日本大通り","元町・中華街"]
# stations.each do |s|
# 	Station.create(area: "神奈川", line: "みなとみらい線", name: s)
# end

# stations = ["鶴見","国道","鶴見小野","弁天橋","浅野","新芝浦","海芝浦","安善","大川","武蔵白石","浜川崎","昭和","扇町"]
# stations.each do |s|
# 	Station.create(area: "神奈川", line: "ＪＲ鶴見線", name: s)
# end

# stations = ["横浜","桜木町","関内","石川町","山手","根岸","磯子","新杉田","洋光台","港南台","本郷台","大船"]
# stations.each do |s|
# 	Station.create(area: "神奈川", line: "ＪＲ根岸線", name: s)
# end

# stations = ["茅ケ崎","北茅ケ崎","香川","寒川","宮山","倉見","門沢橋","社家","厚木","海老名","入谷","相武台下","下溝","原当麻","番田","上溝","南橋本","橋本"]
# stations.each do |s|
# 	Station.create(area: "神奈川", line: "ＪＲ相模線", name: s)
# end

# stations = ["あざみ野","中川","センター北","センター南","仲町台","新羽","北新横浜","新横浜","岸根公園","片倉町","三ツ沢上町","三ツ沢下町","横浜","高島町","桜木町","関内","伊勢佐木長者町","阪東橋","吉野町","蒔田","弘明寺","上大岡","港南中央","上永谷","下永谷","舞岡","戸塚","踊場","中田","立場","下飯田","湘南台"]
# stations.each do |s|
# 	Station.create(area: "神奈川", line: "ブルーライン", name: s)
# end

# stations = ["中山","川和町","都筑ふれあいの丘","センター南","センター北","北山田","東山田","高田","日吉本町","日吉"]
# stations.each do |s|
# 	Station.create(area: "神奈川", line: "グリーンライン", name: s)
# end

# stations = ["新杉田","南部市場","鳥浜","並木北","並木中央","幸浦","産業振興センター","福浦","市大医学部","八景島","海の公園柴口","海の公園南口","野島公園","金沢八景"]
# stations.each do |s|
# 	Station.create(area: "神奈川", line: "金沢シーサイドライン", name: s)
# end

# stations = ["横浜","平沼橋","西横浜","天王町","星川","和田町","上星川","西谷","鶴ヶ峰","二俣川","希望ヶ丘","三ツ境","瀬谷","大和","相模大塚","さがみ野","かしわ台","海老名"]
# stations.each do |s|
# 	Station.create(area: "神奈川", line: "相鉄本線", name: s)
# end

# stations = ["二俣川","南万騎が原","緑園都市","弥生台","いずみ野","いずみ中央","ゆめが丘","湘南台"]
# stations.each do |s|
# 	Station.create(area: "神奈川", line: "相鉄いずみ野線", name: s)
# end

# stations = ["千葉","本千葉","蘇我","鎌取","誉田","土気","大網","永田","本納","新茂原","茂原","八積","上総一ノ宮","東浪見","太東","長者町","三門","大原","浪花","御宿","勝浦","鵜原","上総興津","行川アイランド","安房小湊","安房天津","安房鴨川"]
# stations.each do |s|
# 	Station.create(area: "千葉", line: "ＪＲ外房線", name: s)
# end

# stations = ["千葉","本千葉","蘇我","浜野","八幡宿","五井","姉ケ崎","長浦","袖ケ浦","巌根","木更津","君津","青堀","大貫","佐貫町","上総湊","竹岡","浜金谷","保田","安房勝山","岩井","富浦","那古船形","館山","九重","千倉","千歳","南三原","和田浦","江見","太海","安房鴨川"]
# stations.each do |s|
# 	Station.create(area: "千葉", line: "ＪＲ内房線", name: s)
# end

# stations = ["千葉","東千葉","都賀","四街道","物井","佐倉","酒々井","成田","空港第２ビル（第２旅客ターミナル）","成田空港（第１旅客ターミナル）","久住","滑河","下総神崎","大戸","佐原","香取","水郷","小見川","笹川","下総橘","下総豊里","椎柴","松岸","銚子"]
# stations.each do |s|
# 	Station.create(area: "千葉", line: "ＪＲ成田線（千葉-銚子）", name: s)
# end

# stations = ["我孫子","東我孫子","湖北","新木","布佐","木下","小林","安食","下総松崎","成田"]
# stations.each do |s|
# 	Station.create(area: "千葉", line: "ＪＲ成田線（我孫子-成田）線", name: s)
# end

# stations = ["木更津","祇園","上総清川","東清川","横田","東横田","馬来田","下郡","小櫃","俵田","久留里","平山","上総松丘","上総亀山"]
# stations.each do |s|
# 	Station.create(area: "千葉", line: "ＪＲ久留里線", name: s)
# end

# stations = ["大網","福俵","東金","求名","成東"]
# stations.each do |s|
# 	Station.create(area: "千葉", line: "ＪＲ東金線", name: s)
# end

# stations = ["佐原","香取","十二橋","潮来","延方","鹿島神宮","鹿島サッカースタジアム（臨）"]
# stations.each do |s|
# 	Station.create(area: "千葉,茨城", line: "ＪＲ鹿島線", name: s)
# end

# stations = ["高崎","高崎問屋町","井野","新前橋","群馬総社","八木原","渋川","敷島","津久田"]
# stations.each do |s|
# 	Station.create(area: "群馬", line: "ＪＲ上越線", name: s)
# end

# stations = ["渋川","金島","祖母島","小野上","小野上温泉","市城","中之条","群馬原町","郷原","矢倉","岩島","川原湯温泉","長野原草津口","群馬大津","羽根尾","袋倉","万座・鹿沢口","大前"]
# stations.each do |s|
# 	Station.create(area: "群馬", line: "ＪＲ吾妻線", name: s)
# end

# stations = ["高崎","北高崎","群馬八幡","安中","磯部","松井田","西松井田","横川"]
# stations.each do |s|
# 	Station.create(area: "群馬", line: "ＪＲ信越本線", name: s)
# end

# stations = ["高崎","高崎問屋町","井野","新前橋","前橋","前橋大島","駒形","伊勢崎","国定","岩宿","桐生","小俣","山前","足利","あしかがフラワーパーク","富田","佐野","岩舟","大平下","栃木","思川","小山"]
# stations.each do |s|
# 	Station.create(area: "栃木,群馬", line: "ＪＲ両毛線", name: s)
# end

# stations = ["宝積寺","下野花岡","仁井田","鴻野山","大金","小塙","滝","烏山"]
# stations.each do |s|
# 	Station.create(area: "栃木", line: "ＪＲ烏山線", name: s)
# end

# stations = ["宇都宮","鶴田","鹿沼","文挟","下野大沢","今市","日光"]
# stations.each do |s|
# 	Station.create(area: "栃木", line: "ＪＲ日光線", name: s)
# end

# stations = ["小山","小田林","結城","東結城","川島","玉戸","下館","新治","大和","岩瀬","羽黒","福原","稲田","笠間","宍戸","友部"]
# stations.each do |s|
# 	Station.create(area: "栃木,茨城", line: "ＪＲ水戸線", name: s)
# end

# stations = ["水戸","常陸青柳","常陸津田","後台","下菅谷","中菅谷","上菅谷","南酒出","額田","河合","谷河原","常陸太田","常陸鴻巣","瓜連","静","常陸大宮","玉川村","野上原","山方宿","中舟生","下小川","西金","上小川","袋田","常陸大子","下野宮"]
# stations.each do |s|
# 	Station.create(area: "茨城", line: "ＪＲ水郡線", name: s)
# end

puts "関東の駅を作成しました"